app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
   public function getUser()
    {
        $id = $this->request->getVar('id');

        if (!$id) {
            return $this->response->setStatusCode(400)
                                  ->setJSON(['error' => 'User ID is required']);
        }

        $user = $this->model->find($id);

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('venu', 'venu34@email.com', '$2y$10$vMM58kd/Fk5NDEs1sZjma.nWl2T1w67knFqQiTsBt1vq39hbrydgq')
---
    public function createUser()
    {
       $data=$this->request->getPost();
       if (!$data) {
        return $this->response->setStatusCode(400)
                              ->setJSON(['error' => 'Enter the correct inputs']);
       }
       if (!isset($data['email']) || !filter_var($data['email'], FILTER_VALIDATE_EMAIL)) {
            return $this->response->setStatusCode(400)
                                  ->setJSON(['error' => 'Email id was invalid']);
        }

        if (!isset($data['password']) || strlen($data['password']) < 8) {
            return $this->response->setStatusCode(400)
                                  ->setJSON(['error' => 'Password should contains 8 characters']);
        }
    $existing=$this->model->where('email',$data['email'])->first();
    if($existing)
        {
            return $this->response->setStatusCode(409)->setJSON(['error'=>'Email already exists']);
        }
    $data['password']= password_hash($data['password'],PASSWORD_DEFAULT);
    $user = $this->model->insert($data);

UPDATE `users` SET `password` = '$2y$10$1P3APFda8Kv4W7m/QfJ6BurTIRPbxObKpXwsd2PpcIBcLc127J2qu'
WHERE `users`.`id` IN ('10')
---
   public function updateUser()
{
    $data = $this->request->getJSON(true);

    $email = $data['email'];
    $password = $data['password'];

    if (!$email || !filter_var($email, FILTER_VALIDATE_EMAIL)) {
        return $this->response->setStatusCode(400)
                              ->setJSON(['error' => 'Email id was invalid']);
    }

    if (!$password || strlen($password) < 8) {
        return $this->response->setStatusCode(400)
                              ->setJSON(['error' => 'Password should contains 8 characters']);
    }

    $user = $this->model->where('email', $email)->first();
    if (!$user) {
        return $this->response->setStatusCode(404)
                              ->setJSON(['error' => 'User not found']);
    }

    $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

    $updated = $this->model->update($user['id'], [
        'password' => $hashedPassword
    ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '15'
DELETE FROM `users`
WHERE `id` IN ('15')
---
     public function deleteUser()
    {
        $id = $this->request->getVar('id');

        if (!$id) {
            return $this->response->setStatusCode(400)
                                  ->setJSON(['error' => 'User ID is required']);
        }

        $user = $this->model->find($id);
        if (!$user) {
            return $this->response->setStatusCode(404)
                                  ->setJSON(['error' => 'User not found']);
        }

        $deleted = $this->model->delete($id);